/* The default title for FUIAttachmentsFormCell.\n This string can be overwritten by the \"attachmentsTItle\" property \n in FUIAttachmentsFormCell. */
"AttachmentsFormatKey" = "Liitteet (%d)";

/* Old singular title format */
"AttachmentsKey" = "Liite (%d)";

/* The action list title when \"add attachment\" button is tapped. */
"AddAttachmentKey" = "Lisää liite";

/* The string for taking a photo in add attachment action list. */
"TakePhotoKey" = "Ota kuva";

/* The string for choosing a photo from the photo library in add attachment action list. */
"PhotoLibraryKey" = "Valokuvakirjasto";

/* The voice announcement when an attachment is deleted */
"AttachmentDeletedKey" = "Liite %d poistettu";

/* The string for selecting a file from the document picker in add attachment action list. */
"FilesKey" = "Tiedostot";

/* The string for canceling adding an attachment in add attahment action list. */
"CancelKey" = "Peruuta";

/* The default placeholder text for FUITitleFormCell.\n App can use the \"placeholderText\" property of FUITitleFormCell to override this string. */
"TitleKey" = "Otsikko";

/* The default placeholder text for FUINoteFormCell.\n App can use the \"placeholderText\" property of FUINoteFormCell to override this string. */
"NotesKey" = "Huomautukset";

/* The default placeholder text for value field of FUISimplePropertyFormCell.\n App can use the \"placeholderText\" property of FUISimplePropertyFormCell to override this string. */
"ValueKey" = "Arvo";

/* The warning string when there is no navigationController for the current\n UITableViewController for the FUIFormCell. */
"NoNavigationCtlWarningKey" = "VAROITUS: FUIFormCell:n nykyisen UITableViewController:n navigationController on tyhjä. FUIAttachmentsFormCell ja ListPickerFormCell eivät toimi oikein.";

/* The format string for valueTextField of DurationPckerFormCell.\n This string can be overwritten by the \"durationFormatString\" property\n in FUIDurationPickerFormCell. */
"DurationKey" = "%d t %d min";

/* The default keyName for the `FUIDurationPickerFormCell`. */
"Duration" = "Kesto";

/* The hour label string in the FUIDurationPickerFormCell */
"hourKey" = "tunti";

/* The hours label string in the FUIDurationPickerFormCell */
"hoursKey" = "tuntia";

/* The minute label string in the FUIDurationPickerFormCell */
"minKey" = "min";

/* The section header title for selected entries in ListPickerFormCell. */
"SelectedKey" = "Valitut";

/* The section header title for all entries in ListPickerFormCell. */
"AllKey" = "Kaikki";

/* The warning string when search is enabled but the ListPickerFormCell\n has the listPickerDataSource set but listPickerSearchResultsUpdating\n property is nil. Search is disabled in this case. */
"NoResultsUpdatingWarningKey" = "Varoitus: haun aktivointi on poistettu, koska listPickerSearchResultsUpdating -ominaisuus ListPickerFormCell:ssä on tyhjä.";

/* The \"Select All\" button title on the List Picker header */
"SelectAllKey" = "Valitse kaikki";

/* The \"Deselect All\" button title on the List Picker header */
"DeselectAllKey" = "Poista kaikkien valinta";

/* The \"Close\" button title on the Barcode Scan View */
"CloseKey" = "Sulje";

/* The \"More\" indicator title displayed in Object Cell when text is truncated, and may be expanded. */
"DisplayMoreKey" = "muut";

/* The \"Less\" indicator title displayed in Object Cell when text is fully displayed, and may be compressed with truncation. */
"DisplayLessKey" = "Vähemmän";

/* The string used in accessibility indicating switch in on. */
"SwitchOn" = "aktivoitu";

/* The string used in accessibility indicating switch is off. */
"SwitchOff" = "aktivointi poistettu";

/* The string used in accessibility informing user to double tap on the switch to toggle between on and off. */
"SwitchTap" = "Vaihda asetusta kaksoisnapauttamalla";

/* The default title for FUIOrderPickerFormCell.\n This string can be overwritten by the \"title\" property \n in FUIOrderPickerFormCell. */
"SortByKey" = "Lajitteluperuste";

/* The sort criterion state for FUIOrderPickerFormItemCell.\n It is used in voice over. */
"NotSelectedKey" = "Ei valittu";

/* Criterion view accessibility hint */
"CriterionHintKey" = "Vaihda valinta kaksoisnapauttamalla";

/* OrderDirection view accessibility hint */
"OrderDirectionHintKey" = "Vaihda lajittelusuunta kaksoisnapauttamalla";

/* FUISliderFormCell accessibility label */
"FUISliderFormCellAccessibilityLabelKey" = "Tämä on liukusäädin %@, jonka maksimiarvo on %@ ja jonka minimiarvo on %@";

/* FUISliderFormCell accessibility hint */
"FUISliderFormCellAccessibilityHintKey" = "Voit pyyhkäistä ylös/alas elementin ollessa valittuna ja muuttaa liukusäätimen arvoa";

/* FUISliderFormCell accessibility value */
"FUISliderFormCellAccessibilityValueKey" = "Nykyinen arvo on %@";

/* FUISliderFormCell accessibility change value */
"FUISliderFormCellAccessibilityChangeValueKey" = "Nykyinen arvo muutettu arvoksi %@";

/* Default hint text for Read-only Field for FUITextFieldFormCell */
"ReadOnlyFieldKey" = "Kirjoitussuojattu kenttä";

/* Default accessibility label for Alternative Input Action button name for FUITextFieldFormCell */
"AlternativeInputActionKey" = "Vaihtoehtoinen syöttötoimi";

/* Button for accessibility voice over announcement */
"ButtonKey" = "Painike";

/* Other accessibility hint strings */
"DoubleTapToOpenKey" = "Kaksoisnapsauta avataksesi";

"DoubleTapToCollapseKey" = "Kaksoisnapsauta tiivistääksesi";

"DoubleTapToSelectFromList" = "Kaksoisnapsauta valitaksesi luettelosta";

"DoubleTapToSelect" = "Kaksoisnapsauta valitaksesi";

"DoubleTapToUnselect" = "Kaksoisnapsauta poistaaksesi valinta";

/* FUIStepperView tip */
"StepperTipKey" = "Tämä on muokattavissa oleva arvojen säädin";

/* FUIStepperView tip unable be edited */
"StepperTipNotEditableKey" = "Tämä on arvojen säädin, jota ei voi muokata";

/* FUIStepperView stepper maximum value */
"StepperMaximumValueKey" = "Maksimiarvo on %@";

/* FUIStepperView stepper minimum value */
"StepperMinimumValueKey" = "Minimiarvo on %@";

/* FUIStepperView increase button */
"StepperIncreaseValueByOneKey" = "Korota arvoa 1:llä";

/* FUIStepperView decrease button */
"StepperDecreaseValueByOneKey" = "Laske arvoa 1:llä";

/* FUIStepperView textField value */
"StepperCurrentValueKey" = "Nykyinen arvo on ";

/* Title for UINavigationBar in the FUISortFilterViewController */
"Filter" = "Suodata";

/* Subtitle for UINavigationBar in the FUISortFilterViewController; \"\\(filteredNum)\" and \"\\(totalNum)\" don't require localization. */
"ResultsOf" = "Tulokset \\(filteredNum) / \\(totalNum)";

/* Title for Action Button in the FUISortFilterViewController; \"\\(filteredNum)\" doesn't require localization. */
"ShowResults" = "Näytä \\(filteredNum) rivit";

/* Title for Button \"Reset\" in UINavigationBar to reset filter criteria in the FUISortFilterViewController */
"Reset" = "Palauta";

/* FUIRangeSliderContentView slider tip */
"SliderTipKey" = "Tämä liukusäädin on muokattavissa. Minimiarvo on %@ ja maksimiarvo on %@";

/* FUIRangeSliderContentView slider tip unable be editable */
"SliderTipNotEditableKey" = "Tämä on liukusäädin, jota ei voi muokata. Minimiarvo on %@ ja maksimiarvo on %@";

/* FUIRangeSliderContentView range slider tip */
"RangeSliderTipKey" = "Tämä aluesäädin on muokattavissa. Minimiarvo on %@ ja maksimiarvo on %@";

/* FUIRangeSliderContentView range slider tip unable be editable */
"RangeSliderTipNotEditableKey" = "Tämä on aluesäädin, jota ei voi muokata. Minimiarvo on %@ ja maksimiarvo on %@";

/* FUIRangeSliderContentView slider value textField */
"SliderValueTextFieldKey" = "Liukusäätimen arvon tekstikenttä";

/* FUIRangeSliderContentView range slider lower value textField */
"RangeSliderLowerValueTextFieldKey" = "Alhaisemman arvon tekstikenttä";

/* FUIRangeSliderContentView range slider upper value textField */
"RangeSliderUpperValueTextFieldKey" = "Korkeamman arvon tekstikenttä";

/* FUIRangeSliderContentView range slider textField hint text */
"RangeSliderTextFieldHintKey" = "Voit syöttää erityisen arvon kaksoisnapsauttamalla";

/* FUIRangeSlider slider thumb tip */
"SliderThumbTipKey" = "Liukusäädin, nykyinen arvo on";

/* FUIRangeSlider slider hint text */
"SliderThumbHintKey" = "Voit pyyhkäistä ylös tai alas muuttaaksesi arvoa";

/* FUIRangeSlider lower range slider thumb tip */
"LowerRangeSliderThumbTipKey" = "Alhaisemman arvon liukusäädin, nykyinen arvo on";

/* FUIRangeSlider lower range slider thumb hint text */
"LowerRangeSliderThumbHintKey" = "Voit pyyhkäistä ylös tai alas muuttaaksesi alhaisempaa arvoa";

/* FUIRangeSlider upper range slider thumb tip */
"UpperRangeSliderThumbTipKey" = "Korkeamman arvon liukusäädin, nykyinen arvo on";

/* FUIRangeSlider upper range slider thumb hint text */
"UpperRangeSliderThumbHintKey" = "Voit pyyhkäistä ylös tai alas muuttaaksesi korkeampaa arvoa";

/* FUIRangeSlider slider value tip */
"SliderValueTipKey" = "Nykyinen arvo on %@";

/* FUIRangeSlider range slider value tip */
"RangeSliderValueTipKey" = "Nykyinen alhaisempi arvo on %@, korkeampi arvo on %@";

